SOAP/test_id.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
<s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<GetMessageContent xmlns="http://tempuri.org/">
<id>492</id>
</GetMessageContent>
</s:Body>
</s:Envelope>