SOAP/test_reg.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <GetDebtorRegister xmlns="http://tempuri.org/">
    </GetDebtorRegister>
  </s:Body>
</s:Envelope>